Repository: alemdisso/gastrobrain
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Recipes
pt: Receitas

source: Meal Plan
pt: Planejamento

source: Ingredients
pt: Ingredientes

source: Delete Recipe
pt: Excluir Receita

source: Cancel
pt: Cancelar

source: Delete
pt: Excluir

source: Sort Options
pt: Opções de Ordenação

source: Name
pt: Nome

source: Rating
pt: Avaliação

source: Difficulty
pt: Dificuldade

source: Filter Recipes
pt: Filtrar Receitas

# deleteConfirmation
source: Are you sure you want to delete "{recipeName}"?
pt: Tem certeza que deseja excluir "{recipeName}"?

source: Sort recipes
pt: Ordenar receitas

# filterRecipesTooltip
source: Filter recipes
pt: Filtrar receitas

source: Minimum Rating
pt: Avaliação Mínima

source: Cooking Frequency
pt: Frequência de Preparo

source: Category
pt: Categoria

source: Any
pt: Qualquer

source: Clear
pt: Limpar

source: Apply
pt: Aplicar

source: Add Recipe
pt: Adicionar Receita

source: Add New Recipe
pt: Adicionar Nova Receita

source: Recipe Name
pt: Nome da Receita

source: Desired Frequency
pt: Frequência Desejada

source: Difficulty Level
pt: Nível de Dificuldade

source: Preparation Time
pt: Tempo de Preparo

source: Cooking Time
pt: Tempo de Cozimento

source: Notes
pt: Observações

source: minutes
pt: minutos

source: Add
pt: Adicionar

# noIngredientsAdded
source: No ingredients added yet
pt: Nenhum ingrediente adicionado ainda

source: Save Recipe
pt: Salvar Receita

source: Loading...
pt: Carregando...

source: Unknown
pt: Desconhecido

# pleaseEnterRecipeName
source: Please enter a recipe name
pt: Por favor, informe o nome da receita

# pleaseEnterValidTime
source: Please enter a valid time
pt: Por favor, informe um tempo válido

source: Error saving recipe:
pt: Erro ao salvar receita:

# unexpectedError
source: An unexpected error occurred
pt: Ocorreu um erro inesperado

source: Edit Recipe
pt: Editar Receita

source: Save Changes
pt: Salvar Alterações

source: Error updating recipe:
pt: Erro ao atualizar receita:

source: Error loading ingredients:
pt: Erro ao carregar ingredientes:

# unexpectedErrorLoadingIngredients
source: An unexpected error occurred while loading ingredients
pt: Ocorreu um erro inesperado ao carregar os ingredientes

# unexpectedErrorDeletingIngredient
source: An unexpected error occurred while deleting the ingredient
pt: Ocorreu um erro inesperado ao excluir o ingrediente

source: An error occurred
pt: Ocorreu um erro

source: Delete Ingredient
pt: Excluir Ingrediente

# deleteIngredientConfirmation
source: Are you sure you want to remove {ingredientName} from this recipe?
pt: Tem certeza de que deseja remover {ingredientName} desta receita?

source: Ingredient deleted successfully
pt: Ingrediente excluído com sucesso

source: Try Again
pt: Tentar Novamente

source: Add Ingredient
pt: Adicionar Ingrediente

source: Search ingredients...
pt: Buscar ingredientes...

source: Refresh
pt: Atualizar

source: Edit
pt: Editar

source: History
pt: Histórico

# historyTitle
source: History: {recipeName}
pt: Histórico: {recipeName}

source: Error loading meals:
pt: Erro ao carregar refeições:

# unexpectedErrorLoadingMeals
source: An unexpected error occurred while loading meals
pt: Ocorreu um erro inesperado ao carregar as refeições

# noMealsRecorded
source: No meals recorded yet
pt: Nenhuma refeição registrada ainda

source: Meal updated successfully
pt: Refeição atualizada com sucesso

source: Error editing meal
pt: Erro ao editar refeição: {error}

# recipesCount
source: {count} recipes
pt: {count} receitas

source: Edit meal
pt: Editar refeição

source: Cook Now
pt: Cozinhar Agora

source: From meal plan
pt: Do planejamento de refeições

# actualTimes
source: Prep: {prepTime}min, Cook: {cookTime}min
pt: Tempos reais - Preparo: {prepTime}min, Cozimento: {cookTime}min

source: Weekly Meal Plan
pt: Planejamento Semanal de Refeições

source: Previous Week
pt: Semana Anterior

source: Next Week
pt: Próxima Semana

source: Tap to jump to current week
pt: Toque para ir para a semana atual

source: This week
pt: Esta semana

source: Meal Options
pt: Opções de Refeição

source: View Recipe Details
pt: Ver Detalhes da Receita

source: Change Recipe
pt: Trocar Receita

source: Manage Recipes
pt: Gerenciar Receitas

source: Mark as Cooked
pt: Marcar como Cozinhada

source: Edit Cooked Meal
pt: Editar Refeição Cozinhada

source: Manage Side Dishes
pt: Gerenciar Acompanhamentos

source: Remove from Plan
pt: Remover do Planejamento

# noRecipesAvailable
source: No recipes available. Add some recipes first.
pt: Nenhuma receita disponível. Adicione algumas receitas primeiro.

# mealNotFoundOrNotCooked
source: Meal not found or not yet cooked
pt: Refeição não encontrada ou ainda não cozinhada

# errorAddingSideDish
source: Error adding side dish: {error}
pt: Erro ao adicionar acompanhamento: {error}

source: No primary recipe found
pt: Nenhuma receita principal encontrada

source: Meal recipes updated successfully
pt: Receitas da refeição atualizadas com sucesso

# errorManagingRecipes
source: Error managing recipes: {error}
pt: Erro ao gerenciar receitas: {error}

source: Side dish - added later
pt: Acompanhamento - adicionado depois

source: Planned meal not found
pt: Refeição planejada não encontrada

source: Recipe not found
pt: Receita não encontrada

source: Main dish
pt: Prato principal

source: Side dish
pt: Acompanhamento

source: Meal marked as cooked
pt: Refeição marcada como cozinhada

# couldNotFindCookedMeal
source: Could not find the cooked meal record
pt: Não foi possível encontrar o registro da refeição cozinhada

source: Side dishes updated successfully
pt: Acompanhamentos atualizados com sucesso

source: Add Side Dishes
pt: Adicionar Acompanhamentos

source: Select Recipe
pt: Selecionar Receita

source: Try this
pt: Experimente

source: All Recipes
pt: Todas as Receitas

source: No recommendations available
pt: Nenhuma recomendação disponível

source: Save
pt: Salvar

source: Add this recipe to meal plan
pt: Adicionar esta receita ao planejamento de refeições

source: Add more recipes to this meal
pt: Adicionar mais receitas a esta refeição

# chooseDifferentRecipe
source: Choose a different recipe
pt: Escolher uma receita diferente

source: Back
pt: Voltar

source: Add Side Dish
pt: Adicionar Acompanhamento

source: Save Meal
pt: Salvar Refeição

source: Recommendation count must be positive
pt: O número de recomendações deve ser positivo

source: No recommendation factors registered
pt: Nenhum fator de recomendação registrado

# unknownWeightProfile
source: Unknown weight profile: {profileName}
pt: Perfil de peso desconhecido: {profileName}

source: Error generating recommendations
pt: Erro ao gerar recomendações

source: Error getting candidate recipes
pt: Erro ao obter receitas candidatas

source: Error getting recipe protein types
pt: Erro ao obter tipos de proteína das receitas

source: Error getting last cooked dates
pt: Erro ao obter datas da última preparação

source: Error getting meal counts
pt: Erro ao obter contagem de refeições

source: Error getting recent meals
pt: Erro ao obter refeições recentes

# factorNotFound
source: Factor not found: {factorId}
pt: Fator não encontrado: {factorId}

# weightProfileBalanced
source: Balanced
pt: Equilibrado

# weightProfileFrequencyFocused
source: Frequency-focused
pt: Focado em Frequência

# weightProfileVarietyFocused
source: Variety-focused
pt: Focado em Variedade

# weightProfileWeekday
source: Weekday
pt: Dia de Semana

# weightProfileWeekend
source: Weekend
pt: Final de Semana

# errorGettingRecipesWithStats
source: Error getting recipes with statistics
pt: Erro ao obter receitas com estatísticas

source: Error getting recently cooked recipe IDs
pt: Erro ao obter IDs de receitas cozinhadas recentemente

source: Error getting recently cooked proteins by date
pt: Erro ao obter proteínas cozinhadas recentemente por data

source: Error calculating protein penalty strategy
pt: Erro ao calcular estratégia de penalidade de proteína

source: Error getting protein types for recipes
pt: Erro ao obter tipos de proteína para receitas

# frequencyDaily
source: Daily
pt: Diário

# frequencyWeekly
source: Weekly
pt: Semanal

# frequencyBiweekly
source: Biweekly
pt: Quinzenal

# frequencyMonthly
source: Monthly
pt: Mensal

# frequencyBimonthly
source: Bimonthly
pt: Bimestral

# frequencyRarely
source: Rarely
pt: Raramente

# proteinBeef
source: Beef
pt: Carne Bovina

# proteinChicken
source: Chicken
pt: Frango

# proteinPork
source: Pork
pt: Carne Suína

# proteinFish
source: Fish
pt: Peixe

# proteinSeafood
source: Seafood
pt: Frutos do Mar

# proteinLamb
source: Lamb
pt: Cordeiro

# proteinCharcuterie
source: Charcuterie
pt: Charcutaria

# proteinOffal
source: Offal
pt: Miúdos

# proteinPlantBased
source: Plant Based
pt: À Base de Plantas

# proteinOther
source: Other
pt: Outro

# categoryMainDishes
source: Main dishes
pt: Pratos principais

# categorySideDishes
source: Side dishes
pt: Acompanhamentos

# categorySandwiches
source: Sandwiches
pt: Sanduíches

# categoryCompleteMeals
source: Complete meals
pt: Refeições completas

# categoryBreakfastItems
source: Breakfast items
pt: Itens de café da manhã

# categoryDesserts
source: Desserts
pt: Sobremesas

# categorySoupsStews
source: Soups/stews
pt: Sopas/ensopados

# categorySalads
source: Salads
pt: Saladas

# categorySauces
source: Sauces
pt: Molhos

# categoryDips
source: Dips
pt: Patês/molhos para mergulhar

# categorySnacks
source: Snacks
pt: Petiscos

# categoryUncategorized
source: Uncategorized
pt: Sem categoria

# timeContextPast
source: Past
pt: Passado

# timeContextCurrent
source: Current
pt: Atual

# timeContextFuture
source: Future
pt: Futuro

# timeContextPastDescription
source: Previous week
pt: Semana anterior

# timeContextCurrentDescription
source: This week
pt: Esta semana

# timeContextFutureDescription
source: Upcoming week
pt: Próxima semana

source: Never
pt: Nunca

# weekOf
source: Week of {dateRange}
pt: Semana de {date}

# thisWeekRelative
source: This week
pt: Esta semana

# nextWeekRelative
source: +1 week
pt: +1 semana

# previousWeekRelative
source: -1 week
pt: -1 semana

# futureWeeksRelative
source: +{count} weeks
pt: +{count} semanas

# pastWeeksRelative
source: {count} weeks
pt: {count} semanas

# additionalRecipesCount
source: {count,plural, =1{1 recipe} other{{count} recipes}}
pt: {count,plural, =1{1 receita} other{{count} receitas}}

source: Sunday
pt: Domingo

source: Monday
pt: Segunda

source: Tuesday
pt: Terça

source: Wednesday
pt: Quarta

source: Thursday
pt: Quinta

source: Friday
pt: Sexta

source: Saturday
pt: Sábado

source: Lunch
pt: Almoço

source: Dinner
pt: Jantar

source: Today
pt: Hoje

source: Add meal
pt: Adicionar refeição

# searchRecipesHint
source: Search recipes...
pt: Buscar receitas...

source: No ingredients added yet
pt: Nenhum ingrediente adicionado ainda

# ingredientCategoryVegetable
source: Vegetable
pt: Vegetal

# ingredientCategoryFruit
source: Fruit
pt: Fruta

# ingredientCategoryProtein
source: Protein
pt: Proteína

# ingredientCategoryDairy
source: Dairy
pt: Laticínios

# ingredientCategoryGrain
source: Grain
pt: Grão

# ingredientCategoryPulse
source: Pulse
pt: Leguminosa

# ingredientCategoryNutsAndSeeds
source: Nuts and Seeds
pt: Nozes e Sementes

# ingredientCategorySeasoning
source: Seasoning
pt: Tempero

# ingredientCategorySugarProducts
source: Sugar Products
pt: Produtos Açucarados

# ingredientCategoryOil
source: Oil
pt: Óleo

# ingredientCategoryOther
source: Other
pt: Outro

# measurementUnitCup
source: Cup
pt: Xícara

# measurementUnitPiece
source: Piece
pt: Unidade

# measurementUnitSlice
source: Slice
pt: Fatia

# measurementUnitTablespoon
source: Tbsp
pt: Colher de sopa

# measurementUnitTeaspoon
source: Tsp
pt: Colher de chá

source: Unit (Optional)
pt: Unidade (Opcional)

source: No unit
pt: Sem unidade

source: Edit Ingredient
pt: Editar Ingrediente

source: New Ingredient
pt: Novo Ingrediente

source: Ingredient Name
pt: Nome do Ingrediente

# pleaseEnterIngredientName
source: Please enter an ingredient name
pt: Por favor, informe o nome do ingrediente

# categoryLabel
source: Category
pt: Categoria

# proteinTypeLabel
source: Protein Type
pt: Tipo de Proteína

# pleaseSelectProteinType
source: Please select a protein type
pt: Por favor, selecione um tipo de proteína

source: Notes (Optional)
pt: Observações (Opcional)

source: Any additional information
pt: Qualquer informação adicional

# addRecipeTitle
source: Add Recipe
pt: Adicionar Receita

source: Remove
pt: Remover

source: Number of Servings
pt: Número de Porções

source: Please enter number of servings
pt: Por favor, informe o número de porções

# pleaseEnterValidNumber
source: Please enter a valid number
pt: Por favor, informe um número válido

source: Prep Time (min)
pt: Tempo de Preparo (min)

source: Cook Time (min)
pt: Tempo de Cozimento (min)

# enterValidTime
source: Enter a valid time
pt: Informe um tempo válido

source: Was it successful?
pt: Foi bem-sucedido?

# editMealTitle
source: Edit {recipeName}
pt: Editar {recipeName}

source: Error loading recipes:
pt: Erro ao carregar receitas:

source: Error selecting date
pt: Erro ao selecionar data

source: No additional recipes available.
pt: Nenhuma receita adicional disponível.

# errorPrefix
source: Error:
pt: Erro:

source: Error loading data:
pt: Erro ao carregar dados:

source: Error refreshing recommendations:
pt: Erro ao atualizar recomendações:

source: Select Ingredient
pt: Selecionar Ingrediente

source: Quantity
pt: Quantidade

source: Unit
pt: Unidade

source: Preparation Notes (Optional)
pt: Observações de Preparo (Opcional)

source: Type to search...
pt: Digite para buscar...

# preparationNotesHint
source: e.g., finely chopped, diced, etc.
pt: ex.: finamente picado, cortado em cubos, etc.

source: Actual Prep Time (min)
pt: Tempo Real de Preparo (min)

source: Actual Cook Time (min)
pt: Tempo Real de Cozimento (min)

source: Cooked on
pt: Cozinhado em

source: Planned for
pt: Planejado para

source: Please select an ingredient
pt: Por favor, selecione um ingrediente

source: Create New Ingredient
pt: Criar Novo Ingrediente

# pleaseEnterQuantity
source: Please enter a quantity
pt: Por favor, informe uma quantidade

source: Override default unit
pt: Substituir unidade padrão

source: From Database
pt: Do Banco de Dados

source: Custom
pt: Personalizado

# addRecipeDialog
source: Add Recipe
pt: Adicionar Receita

# selectRecipeToAddAsSideDish
source: Select a recipe to add as a side dish:
pt: Selecione uma receita para adicionar como acompanhamento:

# buttonAddRecipe
source: Add Recipe
pt: Adicionar Receita

# buttonCancel
source: Cancel
pt: Cancelar

# cookRecipeTitle
source: Cook {recipeName}
pt: Cozinhar {recipeName}

source: Cooked on: {date}
pt: Cozinhada em: {date}

source: Planned for: {date}
pt: Planejada para: {date}

# ingredientsTitle
source: Ingredients: {recipeName}
pt: Ingredientes: {recipeName}

# unitOverridden
source: Unit overridden (default: {defaultUnit})
pt: Unidade substituída (padrão: {defaultUnit})

# recipesLabel
source: Recipes
pt: Receitas

# removeTooltip
source: Remove
pt: Remover

# prepTimeLabel
source: Prep Time (min)
pt: Tempo de Preparo (min)

# cookTimeLabel
source: Cook Time (min)
pt: Tempo de Cozimento (min)

source: Show Less
pt: Mostrar Menos

source: Show More
pt: Mostrar Mais

# detailedTimesCooked
source: Times Cooked: {mealCount}
pt: Preparada {mealCount} vezes

# detailedLastCooked
source: Last Cooked: {formattedLastCooked}
pt: Preparada em {formattedLastCooked}

source: View recipe details (not implemented)
pt: Ver detalhes da receita (não implementado)

# errorMarkingMealAsCooked
source: Error marking meal as cooked: {error}
pt: Erro ao marcar refeição como cozinhada: {error}

# cookedMealRecordNotFound
source: Could not find the cooked meal record
pt: Não foi possível encontrar o registro da refeição cozinhada

# searchSideDishesHint
source: Search side dishes...
pt: Buscar acompanhamentos...

# noRecipesFoundMatching
source: No recipes found matching "{query}"
pt: Nenhuma receita encontrada para "{query}"

source: No available side dishes
pt: Nenhum acompanhamento disponível

source: Clear search
pt: Limpar busca
